{
  "epochs": 100,
  "interactive_layer_lr": 0.15,
  "batch_size": 320,
  "early_stop": "diff",
  "optimizer": {
    "learning_rate": 0.15,
    "optimizer": "SGD"
  },
  "loss": "binary_crossentropy",
  "metrics": [
    "AUC"
  ],
  "bottom_nn_define": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              10
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "dense_input"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "batch_input_shape": [
              null,
              10
            ],
            "dtype": "float32",
            "units": 2,
            "activation": "tanh",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "minval": -1,
                "maxval": 1,
                "seed": 123
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.5.0",
    "backend": "tensorflow"
  },
  "top_nn_define": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_2",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "dense_2_input"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "minval": -1,
                "maxval": 1,
                "seed": 123
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.5.0",
    "backend": "tensorflow"
  },
  "interactive_layer_define": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "dense_1_input"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "batch_input_shape": [
              null,
              2
            ],
            "dtype": "float32",
            "units": 2,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "minval": -1,
                "maxval": 1,
                "seed": 123
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    },
    "keras_version": "2.5.0",
    "backend": "tensorflow"
  },
  "config_type": "keras"
}